
# print("hallo, world")

 ## int: integer - მთელი რიცხვი
## x & y - ცვლადები  # 6, 2, - მონაცემები
# x = 6
# y = 2
########################################
# x = 8
# y = 3
########################################

# level = x*y+x-y 
########################################
## მიმატება
# print(x + y)

## გამოკლება
# print(x - y)

## გაყოფა
# print(x / y)   #float - არამთელი რიცხვი

## გამრავლება
# print(x*y)

## ხარისხი
# print(x**y)

## შედარება
# print(x==y)

###############################################
## str: string - ტექსტი, იწერება ყოველთვის ბრჭყალებში
## ჩაშენებული ფუნქცია upper and lower - დიდი და პატარა ასოები...
#####################
# name = "Nika"
###########################################################################

## გამარჯობა [სახელი], შენი ლეველია: [ლეველი]

# print("hallo", name.lower(), ",", "your level is:," level)
###################################################################

## Bool - ბული

# True
# False
# z = 8
# print(x==z)
#################################################

## MONACEMTA STRUKTUREBI

## 1) List - სია
## 2) Set - სიმრავლე
## 3) Tuple - ტუპლი
## 4) dictionary - ლექსიკონი



############################################


## List = [] - სია

## Allows diferent data types - შესაძლებელია სხვადასხვა მონაცემის ერთ ლისტში შენახვა
## len() - length: ზომა/სიგრძე    #print(len(mylist))
## Changeable - ცვალებადი    # mylist[index] = ***     # print(mylist)
## Allows duolicates - შესაძლებელია დუპლიკატების ქონა
## ლისტში ბოლო ელემენტი არის ლისტის სიგრძეს მინუს ერთ პოზიციაზე ანუ ინდექსზე.
## append() - ამატებს ახალ ელემენტს ბოლო ინდექსზე mylist.append(***)
## pop() - შეგვიძლია წავშალოთ ელემენტი ლისტიდან ინდექსის საშუალებით
## remove() - შეგვიძლია წავშალოთ ელემენტი ლისტიდან მისი დასახელებით
## insert() - ამატებს ახალ ელემენტს სიაში ჩვენს მითითებულ ინდექსზე    mylist.insert(ინდექსი ,  და ახალი ელემენტის დასახელება )
## clear() - ლისტის გასუფთავება mylist.clear()
## del - სიის წაშლა    del mylist
## sort - ლისტი ლაგდება ანბანის ან რიცხვების შესაბამისად

##################################################################################



# mylist = [1, 2, "Dato", "Ana", True, False, 3.0, "saqartvelo", 10, "mariami"]

# S = mylist[3]     # მონაცემის(ელემენტის) გამოტანა ინდექსის საშუალებით
# print(S)

# mylist[1] = "sandro"     # მონაცემის შეცვლა კონკრეტულ ინდექსზე ინდექსით
# print(mylist)

# n = len(mylist)
# print(mylist[len(mylist)-1])    # ლისტის ბოლო ელემენტის გამოტანა
# print(mylist[n-1])              # ლისტის ბოლო ელემენტის გამოტანა
# print(mylist[-1])               # ლისტის ბოლო ელემენტის გამოტანა 

# print(mylist[6])   # ელემენტის(მონაცემის) გამოტანა ინდექსის საშუალებით

# mylist.append("Tbilisi")   # ელემენტის დამატება
# print(mylist)

# print(len(mylist))

# mylist[2] = "name"    # ელემენტის შეცვლა სხვა ელემენტით ინდექსის საშუალებით
# print(mylist)         # ელემენტი შეიცვლება იმ ინდექსზე რომელზეც ის იდგა

# mylist.remove(1)      # ელემენტის წაშლა დასახელებით
# print(mylist) 




###################################################################


## Set = {} - სიმრავლე

## allows different data types - შესაძლებელია სხვადასხვა ტიპის მონაცემის ერთ სიმრავლეში შენახვა
## Unordered - დაულაგებელი: ელემენტებს არ გააჩნით ფიქსირებული ინდექსი
## does not allow duplicates - არ უშვებს დუპლიკატებს
## u nchangeable - უცვლელი: შეუძლებელია არსებული ელემენტის ახალი ელემენტით ჩანაცვლება
## add() - ელემენტის დამატება სიმრავლეში    # myset.add()
## remove() - ელემენტის წაშლა სიმრავლიდან  # myset.remove()
## union() - ორი სიმრავლის გაერთიანება და შედეგის ახალ სიმრავლეში შენახვა
## update() - არსებულ სიმრავლეზე ახალი სიმრავლის დამატება




############################################################################

## TUPLE - ტუპლი



## allows different data types & duplicates - შესაძლებელია სხვადასხვა ტიპის მონაცემის ერთ ტუპლში შენახვა, ასევე დაშვებულია დუპლიკატები
## ordered and unchangeable - დალაგებული და უცვლელი: ტუპლის ელემენტის ჩანაცვლება ან წაშლა შეუძლებელია.

##############
# mytuple = (1, 2, 3, 4, "sandro", "mariami", 2, 1)
# sandro = (34, 45, 67, 78, "niangi")

## tupleaddition = mytuple + sandro - ორი ტუპლის გაერთიანება ახალ ტუპლში
## print(tupleaddition)

## print(mytuple.index("sandro")) - ინდექსის გაგება მონაცემის საშუალებით
##############


##############################################################################################


## DICTIONARY - ლექსიკონი

## ordered, changeable, does not allow duplicates

## kay: value


## cars = {"brand": "Ford", 
##       "model": "mustang",
##       "year": 1964}

## print(cars.keys()) - ყველა ქის გაგება. იგივეა values პრინციპი

## cars["color"] = ["red", "black", "white"] - ჩამატება
## cars.pop("year") - ქის ამოღება
## cars["year"] = 2022 - შეცვლა



##################################################################################

### Conditionals ### - პირობითები

## If, else, elif

# n = 0
# if n>0:
#     print("es ricxvi aris dadebiti")
# elif n<0:
#     print("es ricxvi aris uaryofiti")
# else:
#     print("es ricxvi aris 0") 


#######################################################################################

## LOOPS ## - ლუპები


 
## while loop##

# n = 100
# i = 0
# while i < 100:
    # print(i)
    # i = i + 1
    

## for loop ##


# n = 100
# mylist = [] 
# numbers_even = []    # initialisation, init - ინიციალიზაცია
# for i in range(100):
    # mylist.append(i**2)
    # if i % 2 == 0:
        # numbers_even.append(i**2) # ამით დავამატეთ ყველა რიცხვის კვადრატი ჩვენს ლისტში
# print(mylist)
# print(numbers_even)
# print(len(mylist))
# print(len(numbers_even))

####################################################################

# ## function - ფუნქცია
 
# from math import sqrt

#####################################################                                            
# def q_e_solver(a,b,c):                             #
                                                     #                                                   
#     d = b**2 - 4*a*c                               #
                                                     # 
#     if d<0:                                        #
#         return(None)                               # 
#     elif d == 0:                                   # 
#         x = -b / (2*a)                             #
#         return(x)                                  #
#     else:                                          # 
#      x1 = (-b + sqrt(d)) / (2*a)
#      x2 = (-b - sqrt(d)) / (2*a)
#     return(x1, x2)
# print(q_e_solver(1,5,0))
# print(type(q_e_solver))  















